#coding:utf-8

import os
import time


print("╔═══╗──────────╔╗─╔╗──╔╗──────╔╗\n║╔═╗║──────────║║─║║──║║──────║║\n║╚══╦══╦═╗╔╗─╔╗║║─║╠═╗║║╔══╦══╣║╔╦══╦═╗\n╚══╗║╔╗║╔╗╣║─║║║║─║║╔╗╣║║╔╗║╔═╣╚╝╣║═╣╔╝\n║╚═╝║╚╝║║║║╚═╝║║╚═╝║║║║╚╣╚╝║╚═╣╔╗╣║═╣║\n╚═══╩══╩╝╚╩═╗╔╝╚═══╩╝╚╩═╩══╩══╩╝╚╩══╩╝\n──────────╔═╝║\n──────────╚══╝\n╔══╗─────╔═╗╔═╗───────╔╗──╔═══╦═══╗\n║╔╗║─────║║╚╝║║───────║║──║╔═╗║╔══╝\n║╚╝╚╦╗─╔╗║╔╗╔╗╠══╦═╦╗╔╣║──║║║║║╚══╗\n║╔═╗║║─║║║║║║║║╔╗║╔╣╚╝║║─╔╣║║║╠══╗║\n║╚═╝║╚═╝║║║║║║║╔╗║║╚╗╔╣╚═╝║╚═╝╠══╝║\n╚═══╩═╗╔╝╚╝╚╝╚╩╝╚╩╝─╚╝╚═══╩═══╩═══╝\n────╔═╝║\n────╚══╝")
print ("欢迎使用SONY Bootloader解锁工具by 酷安@阿灏永驻基安\n在开始之前，请确认此文件已放置于fastboot.exe同目录下\n且已进入Fastboot模式（蓝灯模式）\n确认已完成以上操作？（y/n）（必须小写）")
yon = input()
if yon == "y":
	print("请输入你的解锁码："),
	unlock = input()
	os.system("fastboot oem unlock 0x" + unlock)
elif yon == "n":
	exit()
else: print("输入不规范，该软件将在3秒内关闭，请重新打开") 
time.sleep(3)